Catalogs/ГИГ_ИерархияЦеновыхГрупп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>ГИГ_ИерархияЦеновыхГрупп</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИерархии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЦеновыеГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>ЦеновыеГруппы</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Иерархия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГИГ_ИерархияЦеновыхГрупп</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГруппыИерархии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеГруппыИерархии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГИГ_ИерархияЦеновыхГрупп/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПроизводительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		СтандартнаяОбработка = Ложь;
		ТекПроизводитель = Объект.Производитель;
		НовоеЗначениеПроизводителя = ВыбранноеЗначение;
		СтруктураРеквизитов = Новый Структура("ТекПроизводитель,НовоеЗначениеПроизводителя",ТекПроизводитель,НовоеЗначениеПроизводителя);
		Вопросы = 0;
		Если  ТекПроизводитель <>  НовоеЗначениеПроизводителя тогда
			// 1. По группа и иерархии текущего элемента / объекта
			Если ЗначениеЗаполнено(Объект.Родитель) тогда
				ТекстВопроса =  "При изменении производителя будет очищен реквизит Родитель."+Символы.ПС+
				"Элемент не будет принадлежать группе."+Символы.ПС+
				"У подчиненных элементов и элементов ценовых групп будет изменен реквизит Производитель "+Символы.ПС+
				"Элемент будет записан."
				"Продолжить?";
				
				Оповещение = Новый ОписаниеОповещения("ИзменениеГруппыЗавершение", ЭтотОбъект, СтруктураРеквизитов); 
				ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
				Вопросы = Вопросы+1;
			иначе
				// проверка на уровни вложенности справочника.... - если меняем производителя родителя, то и у вложенных элементов корректируем реквизит
				КоличествоИерархии = ПолучитьКоличествоЭлементовИерархии(объект.Ссылка,"Количество");
				Если КоличествоИерархии <> 0 тогда
					ТекстВопроса =  "При изменении производителя у подчиненных элементов и их элементов ценовых групп будет изменен реквизит Производитель."+Символы.ПС+
					"Количество подчиненных элементов:"+КоличествоИерархии+""+Символы.ПС+
					"Элемент будет записан."+Символы.ПС+
					"Продолжить?";
					Оповещение = Новый ОписаниеОповещения("ИзменениеПроизводителяИерархииЗавершение", ЭтотОбъект, СтруктураРеквизитов); 
					ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
					Вопросы = Вопросы+1;
				иначе
					// проверим есть ли цг подчиненные
					КоличествоЭлементовЦГ = ПолучитьЭлементыПодчиненные(объект.Ссылка,ТекПроизводитель,"Количество");
					Если КоличествоЭлементовЦГ <> 0 тогда
						ТекстВопроса =  "При изменении производителя у подчиненных элементов и их элементов ценовых групп будет изменен реквизит Производитель."+Символы.ПС+
						"Количество подчиненных элементов:"+КоличествоЭлементовЦГ+""+Символы.ПС+
						"Элемент будет записан."+Символы.ПС+
						"Продолжить?";
						Оповещение = Новый ОписаниеОповещения("ИзменениеГруппыЗавершение", ЭтотОбъект, СтруктураРеквизитов); 
						ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
						Вопросы = Вопросы+1;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		Если вопросы = 0 Тогда 
		Объект.Производитель = НовоеЗначениеПроизводителя;
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

//*****************************************************************************
&НаКлиенте
Процедура ИзменениеГруппыЗавершение(Ответ, СтруктураРеквизитов) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	ИзменитьПодчинныеЭлементы(СтруктураРеквизитов);
КонецПроцедуры

//*****************************************************************************

//*****************************************************************************
&НаСервере
Функция ПолучитьКоличествоЭлементовИерархии(СсылкаНаЭлемент,ПризВозврата)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГИГ_ИерархияЦеновыхГрупп.Ссылка
	               |ИЗ
	               |	Справочник.ГИГ_ИерархияЦеновыхГрупп КАК ГИГ_ИерархияЦеновыхГрупп
	               |ГДЕ
	               |	ГИГ_ИерархияЦеновыхГрупп.Родитель В ИЕРАРХИИ(&Родитель)";
	Запрос.УстановитьПараметр("Родитель",СсылкаНаЭлемент);
	Результат = Запрос.Выполнить().Выгрузить();
	Если ПризВозврата = "Количество" Тогда 
		Возврат Результат.Количество();	
	Иначе
		Возврат Результат;	
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ИзменениеПроизводителяИерархииЗавершение(Ответ, СтруктураРеквизитов) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	ИзменитьПодчинныеЭлементы(СтруктураРеквизитов);

КонецПроцедуры

//*****************************************************************************

//*****************************************************************************
&НаСервере
Процедура ИзменитьПодчинныеЭлементы(СтруктураРеквизитов)
	
	ТекОбъект = Объект.Ссылка.ПолучитьОбъект();
	Если ТекОбъект.Родитель.Производитель  <> СтруктураРеквизитов.НовоеЗначениеПроизводителя Тогда 
		 ТекОбъект.Родитель = Справочники.ГИГ_ИерархияЦеновыхГрупп.ПустаяСсылка();
	КонецЕсли;	
	ТекОбъект.Производитель = СтруктураРеквизитов.НовоеЗначениеПроизводителя;
	ТекОбъект.Записать();
	ЭтотОбъект.Прочитать();
	ТаблицаЭлементов = ПолучитьКоличествоЭлементовИерархии(Объект.Ссылка,"Данные");
	Если ТаблицаЭлементов.количество() <> 0 тогда
		Для Каждого ТекЭлементЦГ из ТаблицаЭлементов цикл
			ТекОбъектКорректировки = ТекЭлементЦГ.Ссылка.ПолучитьОбъект();
			ТекОбъектКорректировки.Производитель = Объект.Производитель;
			ТекОбъектКорректировки.Записать();
			
			// корректировка всех ЦГ подчиненного элемента
			ТаблицаЭлементовЦГ = ПолучитьЭлементыПодчиненные(ТекОбъектКорректировки.Ссылка,СтруктураРеквизитов.ТекПроизводитель,"Данные");	
			Для Каждого ТекЭлементЦГ из ТаблицаЭлементовЦГ цикл
				ТекОбъектКорректировки = ТекЭлементЦГ.Ссылка.ПолучитьОбъект();
				ТекОбъектКорректировки.Производитель = Объект.Производитель;
				ТекОбъектКорректировки.Записать();
			КонецЦикла;	
		КонецЦикла;	
	иначе
		// корректировка всех ЦГ подчиненного элемента
		ТаблицаЭлементовЦГ = ПолучитьЭлементыПодчиненные(Объект.Ссылка,СтруктураРеквизитов.ТекПроизводитель,"Данные");	
		Для Каждого ТекЭлементЦГ из ТаблицаЭлементовЦГ цикл
			ТекОбъектКорректировки = ТекЭлементЦГ.Ссылка.ПолучитьОбъект();
			ТекОбъектКорректировки.Производитель = Объект.Производитель;
			ТекОбъектКорректировки.Записать();
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьЭлементыПодчиненные(Иерархия,ТекПроизводитель,ПризВозврата)
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЦеновыеГруппы.Ссылка
	                |ИЗ
	                |	Справочник.ЦеновыеГруппы КАК ЦеновыеГруппы
	                |ГДЕ
	                |	ЦеновыеГруппы.Производитель = &Производитель
	                |	И ЦеновыеГруппы.Иерархия В ИЕРАРХИИ(&Иерархия)" ;
	Запрос.УстановитьПараметр("Производитель",ТекПроизводитель);
	Запрос.УстановитьПараметр("Иерархия",Иерархия);
	Результат = Запрос.Выполнить().Выгрузить();
	Если ПризВозврата = "Количество" Тогда 
		Возврат Результат.Количество();	
	Иначе
		Возврат Результат;	
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ОбновлениеФормыСписка",,ЭтаФорма);
КонецПроцедуры

//*****************************************************************************
